let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪🕌❫━━══━━━❍*\n`
  message += `*┊⇇ أدعية دخول المسجد*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*🔹 دعاء دخول المسجد:*\n`
  message += `اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ\n\n`

  message += `*🔹 دعاء الخروج من المسجد:*\n`
  message += `اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ\n\n`

  message += `*🔹 دعاء آخر عند الدخول:*\n`
  message += `بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ\n\n`

  message += `*🔹 الصلاة على النبي عند الدخول:*\n`
  message += `اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ\n\n`

  message += `*🔹 دعاء تحية المسجد:*\n`
  message += `سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ\n\n`

  message += `*╯━━━══━━❪🕋❫━━══━━━❍*\n`
  message += `> `

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-دخول-المسجد']
handler.tags = ['fun']
handler.command = /^(دعاء-دخول-المسجد)$/i

export default handler