let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪🌧️❫━━══━━━❍*\n`
  message += `*┊⇇ أدعية نزول المطر*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*1.* اللَّهُمَّ صَيِّبًا نَافِعًا\n\n`
  message += `*2.* اللَّهُمَّ اجْعَلْهُ صَيِّبًا هَنِيئًا مَرِيئًا\n\n`
  message += `*3.* مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ\n\n`
  message += `*4.* اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهُ وَخَيْرَ مَا فِيهِ وَخَيْرَ مَا أُرْسِلَ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا فِيهِ وَشَرِّ مَا أُرْسِلَ بِهِ\n\n`
  message += `*5.* اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا هَنِيئًا مَرِيئًا غَدَقًا مُجَلِّلًا سَحًّا عَامًّا نَافِعًا غَيْرَ ضَارٍّ\n\n`
  message += `*6.* سُبْحَانَ الَّذِي يُنَزِّلُ الْغَيْثَ وَيَكْشِفُ السُّوءَ\n\n`

  message += `*╯━━━══━━❪🤲❫━━══━━━❍*\n`
  message += `> `

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-نزول-المطر']
handler.tags = ['fun']
handler.command = /^(دعاء-نزول-المطر)$/i

export default handler