let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪📖❫━━══━━━❍*\n`
  message += `*┊⇇ دعاء ختم القرآن الكريم*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*1.* اللَّهُمَّ ارْحَمْنِي بِالْقُرْآنِ، وَاجْعَلْهُ لِي إِمَامًا وَنُورًا وَهُدًى وَرَحْمَةً\n\n`
  message += `*2.* اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَا نَسِيتُ، وَعَلِّمْنِي مِنْهُ مَا جَهِلْتُ، وَارْزُقْنِي تِلَاوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ\n\n`
  message += `*3.* اللَّهُمَّ اجْعَلِ الْقُرْآنَ لِي رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي\n\n`
  message += `*4.* اللَّهُمَّ إِنِّي عَبْدُكَ وَابْنُ عَبْدِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ\n\n`
  message += `*5.* اللَّهُمَّ اجْعَلْنَا مِنْ أَهْلِ الْقُرْآنِ الَّذِينَ هُمْ أَهْلُكَ وَخَاصَّتُكَ\n\n`
  message += `*6.* اللَّهُمَّ تَقَبَّلْ مِنَّا تِلَاوَةَ كِتَابِكَ، وَاجْعَلْنَا مِمَّنْ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ وَيُقِيمُونَ حُرُوفَهُ وَيَعْمَلُونَ بِمَا فِيهِ\n\n`

  message += `*╯━━━══━━❪📗❫━━══━━━❍*\n`
  message += `> برعاية الفحلين ادم وعمر ايهاب`

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-ختم-القرآن']
handler.tags = ['fun']
handler.command = /^(دعاء-ختم-القرآن)$/i

export default handler