let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪💔❫━━══━━━❍*\n`
  message += `*┊⇇ أدعية التوبة والاستغفار*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*1.* أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ\n\n`
  message += `*2.* اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ\n\n`
  message += `*3.* اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلَانِيَتَهُ وَسِرَّهُ\n\n`
  message += `*4.* رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ\n\n`
  message += `*5.* اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ\n\n`
  message += `*6.* اللَّهُمَّ تُبْ عَلَيَّ حَتَّى تَرْضَى، وَارْزُقْنِي التَّوْبَةَ النَّصُوحَ يَا أَرْحَمَ الرَّاحِمِينَ\n\n`

  message += `*╯━━━══━━❪🕊️❫━━══━━━❍*\n`
  message += `> برعايه الفحل ادم`

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-التوبة']
handler.tags = ['fun']
handler.command = /^(دعاء-التوبة)$/i

export default handler