let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪✈️❫━━══━━━❍*\n`
  message += `*┊⇇ أدعية السفر*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*1.* اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ\n\n`
  message += `*2.* اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى\n\n`
  message += `*3.* اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ\n\n`
  message += `*4.* اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ\n\n`
  message += `*5.* اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ\n\n`
  message += `*6.* اللَّهُمَّ بَلِّغْنَا مَقْصَدَنَا سَالِمِينَ غَانِمِينَ وَرُدَّنَا إِلَى أَهْلِنَا سَالِمِينَ\n\n`

  message += `*╯━━━══━━❪🛫❫━━══━━━❍*\n`
  message += `> برعاية الفحل ادم`

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-السفر']
handler.tags = ['fun']
handler.command = /^(دعاء-السفر)$/i

export default handler