let handler = async (m, { conn }) => {

  let message = `*╮━━━══━━❪🌙❫━━══━━━❍*\n`
  message += `*┊⇇ أدعية النوم*\n`
  message += `*╰━━━══━━❪🤲❫━━══━━━❍*\n\n`

  message += `*1.* بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا\n\n`
  message += `*2.* اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ\n\n`
  message += `*3.* سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ\n\n`
  message += `*4.* اللَّهُمَّ بِاسْمِكَ أَحْيَا وَبِاسْمِكَ أَمُوتُ\n\n`
  message += `*5.* اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ\n\n`
  message += `*6.* اللَّهُمَّ احْفَظْنِي فِي مَنَامِي وَأَيْقِظْنِي فِي خَيْرٍ\n\n`

  message += `*╯━━━══━━❪⭐❫━━══━━━❍*\n`
  message += `> `

  await conn.sendMessage(m.chat, { text: message }, { quoted: m })
}

handler.help = ['دعاء-النوم']
handler.tags = ['fun']
handler.command = /^(دعاء-النوم)$/i

export default handler