let handler = async (m, { conn }) => {

  let menu = `
╭━〔 🎨 قائمة اللوجوهات 〕━╮

🧠 اكتب الأمر + اسمك

✦ .ناروتو → لوجو ناروتو 🔥
✦ .ذهب → لوجو ذهبي 👑
✦ .نيون_ملون → نيون ملون 🌈
✦ .توهج_نيون → نيون متوهج ⚡
✦ .مجرة → لوجو مجرة 🌌
✦ .نيون_مجرة → نيون + مجرة 🔥
✦ .ملكي → تصميم ملكي 👑
✦ .هولوغرام → تأثير هولوجرام 💫
✦ .نص_تحت_الماء → تحت الماء 🌊
✦ .شاطئ → كتابة على الرمل 🏖️
✦ .رمل → تأثير رملي 🌴
✦ .سحب → كتابة في السحاب ☁️
✦ .مطر → تأثير المطر 🌧️
✦ .نجوم → نجوم ليلية ⭐
✦ .غرافيتي → جرافيتي شارع 🎨
✦ .رسوم_كرتونية → ستايل كرتون 😎
✦ .ورق_مقطع → ورق 3D ✂️
✦ .ألوان_مائية → ألوان مائية 🎨
✦ .تدرج_لوني → Gradient 🌈
✦ .توهج_متقدم → توهج احترافي 🔥
✦ .نص_مشوه → glitch 😈
✦ .تكسير_بكسل → pixel 💻
✦ .نص_ممحو → تأثير مسح ✏️
✦ .نص_على_زجاج → على زجاج 💧
✦ .نص_طباعي → طباعة 📰
✦ .صانع_شعار → لوجو جاهز 🐻
✦ .بلاك_بنك → ستايل بلاك بينك 💗
✦ .شعار_بلاك_بنك → لوجو بلاك بينك 🎤
✦ .علم_أمريكا → علم أمريكا 🇺🇸
✦ .علم_نيجيريا → علم نيجيريا 🇳🇬
✦ .أمونج_أس → among us 🚀
✦ .ميزان_موسيقي → موسيقى 🎵
✦ .أجنحة → أجنحة ملاك 👼

╰━━━━━━━━━━━━━━━╯
`

  conn.reply(m.chat, menu, m)
}

handler.command = ['لوجو']
export default handler